[
  {
    "id": "avatars",
    "text": "Avatars",
    "description": "Avatar is a graphical representation of a user or entity in a software application or website, typically represented as a small square or circular image. Avatars can be personalized with a user's photo or custom image, and are commonly used in messaging applications, forums, and social media platforms to identify users and add a visual element to their profiles or messages."
  },
  {
    "id": "buttons",
    "text": "Buttons",
    "description": "Button elements represents a command or action that can be triggered by the user through a click or tap."
  },
  {
    "id": "navbars",
    "text": "Navbars",
    "description": "Navbar elements typically appears at the top of a website or application and contains links or buttons for navigating to different sections or pages within the site or app."
  },
  {
    "id": "sidebars",
    "text": "Sidebars",
    "description": "A sidebar is a UI element used for displaying additional information or navigation options alongside the main content of a webpage or application."
  },
  {
    "id": "cards",
    "text": "Cards",
    "description": "Card UI is a website or application design pattern that displays information in small, rectangular containers called 'cards.' These cards can be used to present various types of content such as text, images, and videos. They are typically arranged in a grid format and can be used for displaying a variety of information, such as product listings, articles, user profiles, or social media posts. The card UI pattern has become increasingly popular due to its ability to provide a visually appealing and organized layout for content, while also being responsive and mobile-friendly."
  },
  {
    "id": "breadcrumbs",
    "text": "Breadcrumbs",
    "description": "Breadcrumbs is a website or application navigation design pattern that displays a trail of links showing the user's current location within the website or application hierarchy. They should be placed at the top of the page, above the page's main content."
  },
  {
    "id": "paginations",
    "text": "Pagination",
    "description": "Pagination is a UI element used for dividing large sets of data into smaller, more manageable pages."
  },
  {
    "id": "form_textinputs",
    "text": "Text Input - Forms",
    "description": "Text input is a UI element used for collecting user information, creating forms, search boxes, comment sections, and editing text."
  },
  {
    "id": "form_checkboxes",
    "text": "Checkboxes - Forms",
    "description": "Checkboxes are UI elements that allow users to select one or more options from a list of choices."
  },
  {
    "id": "pages_login",
    "text": "Login - Pages",
    "description": "A login-in page is a UI element used for authentication and access control, requiring users to provide valid login credentials before accessing a website or application."
  },
  {
    "id": "pages_register",
    "text": "Register - Pages",
    "description": "A register page is a UI element used for creating new user accounts and collecting necessary information such as name, email address, and password."
  },
  {
    "id": "pages_error",
    "text": "Error - Pages",
    "description": "An error page is a UI element that appears when a website or application encounters an error, displaying a message or graphic that informs the user that something has gone wrong."
  },
  {
    "id": "sections_cta",
    "text": "Call to Action (CTA) - Section",
    "description": "A call-to-action is a UI element used to encourage users to take a specific action, such as signing up for a service or purchasing a product, typically displayed prominently and using persuasive language and design."
  },
  {
    "id": "sections_features",
    "text": "Features - Section",
    "description": "A features section is a UI element used to showcase the key features and functionalities of a product or service, typically presented in a visually engaging manner with concise descriptions and illustrations."
  },
  {
    "id": "sections_footers",
    "text": "Footers - Section",
    "description": "A footer section is a UI element used for displaying additional information or navigation options at the bottom of a webpage, typically including copyright notices, contact information, and links to important pages."
  },
  {
    "id": "sections_pricing",
    "text": "Pricing - Section",
    "description": "A pricing section is a UI element used to display different pricing options for a product or service, typically presented in a table format with clear descriptions of the features and benefits of each option."
  }
]
